src/app/Models/BookingModel.php

SELECT *
FROM `bookings`
WHERE `id` = 3
AND `user_id` = 2
 LIMIT 1
---
    public function getByIdAndUser(int $id, int $userId): ?array
    {
        return $this->where('id', $id)
                    ->where('user_id', $userId)
                    ->first();

SELECT `date`, COUNT(*) as booking_count
FROM `bookings`
WHERE `activity_name` = 'Jet Ski'
AND `status` NOT IN ('cancelled')
GROUP BY `date`
HAVING `booking_count` >= 5
---
    public function getBookedDates(string $activity): array
    {
        $results = $this->select('date, COUNT(*) as booking_count')
                        ->where('activity_name', $activity)
                        ->whereNotIn('status', ['cancelled'])
                        ->groupBy('date')
                        ->having('booking_count >=', 5)
                        ->findAll();