src/app/Models/BookingModel.php

    public function getByIdAndUser(int $id, int $userId): ?array
    {
        return $this->where('id', $id)
                    ->where('user_id', $userId)
                    ->first();
---
SELECT *
FROM `bookings`
WHERE `id` = 40
AND `user_id` = 8
 LIMIT 1

    public function getBookedSlots(string $activity, string $date): array
    {
        $results = $this->select('time')
                        ->where('activity_name', $activity)
                        ->where('date', $date)
                        ->whereNotIn('status', ['cancelled'])
                        ->findAll();
---
SELECT `time`
FROM `bookings`
WHERE `activity_name` = 'Banana Boat'
AND `date` = '2026-05-14'
AND `status` NOT IN ('cancelled')