src/app/Models/BuoyDataModel.php

SELECT *
FROM `buoy_data`
ORDER BY `recorded_at` DESC
 LIMIT 1
---
    public function getLatestReading()
    {
        return $this->orderBy('recorded_at', 'DESC')
                    ->limit(1)
                    ->first();