src/app/Controllers/admin.php

SELECT `b`.*, `u`.`username`
FROM `bookings` `b`
LEFT JOIN `users` `u` ON `u`.`id` = `b`.`user_id`
ORDER BY `b`.`created_at` DESC
 LIMIT 15
---
    public function updateBookingStatus()
    {
        if ($r = $this->requireAdmin()) return $r;

        $id     = (int) $this->request->getPost('id');
        $status = $this->request->getPost('status');

        $allowed = ['confirmed', 'completed', 'cancelled'];
        if (! $id || ! in_array($status, $allowed)) {
            return redirect()->back()->with('error', 'Invalid request.');
        }

        $db = \Config\Database::connect();
        $db->table('bookings')->where('id', $id)->update(['status' => $status]);

        return redirect()->to(base_url('admin/bookings'))
                         ->with('success', 'Booking status updated to ' . ucfirst($status) . '.');

SELECT *
FROM `sea_conditions`
ORDER BY `recorded_at` DESC
 LIMIT 1
SELECT `sc`.*, `u`.`username` AS `admin_username`
FROM `sea_conditions` `sc`
LEFT JOIN `users` `u` ON `u`.`id` = `sc`.`updated_by`
ORDER BY `sc`.`recorded_at` DESC
 LIMIT 20
---
    public function seaConditions()
    {
        if ($r = $this->requireAdmin()) return $r;

        $db = \Config\Database::connect();

        $latestSea  = $db->table('sea_conditions')
            ->orderBy('recorded_at', 'DESC')
            ->limit(1)
            ->get()->getRowArray();

        $seaHistory = $db->table('sea_conditions sc')
            ->select('sc.*, u.username AS admin_username')
            ->join('users u', 'u.id = sc.updated_by', 'left')
            ->orderBy('sc.recorded_at', 'DESC')
            ->limit(20)
            ->get()->getResultArray();

SELECT `r`.*, `u`.`username`
FROM `reviews` `r`
LEFT JOIN `users` `u` ON `u`.`id` = `r`.`user_id`
ORDER BY `r`.`created_at` DESC
---
    public function reviews()
    {
        if ($r = $this->requireAdmin()) return $r;

        $db = \Config\Database::connect();

        $reviews = $db->table('reviews r')
            ->select('r.*, u.username')
            ->join('users u', 'u.id = r.user_id', 'left')
            ->orderBy('r.created_at', 'DESC')
            ->get()->getResultArray();

SELECT `b`.*, `u`.`username`
FROM `bookings` `b`
LEFT JOIN `users` `u` ON `u`.`id` = `b`.`user_id`
WHERE `b`.`status` IN ('confirmed','completed')
ORDER BY `b`.`created_at` DESC
---
    public function sales()
    {
        if ($r = $this->requireAdmin()) return $r;

        $db = \Config\Database::connect();

        $sales = $db->table('bookings b')
            ->select('b.*, u.username')
            ->join('users u', 'u.id = b.user_id', 'left')
            ->whereIn('b.status', ['confirmed', 'completed'])
            ->orderBy('b.created_at', 'DESC')
            ->get()->getResultArray();