src/app/Controllers/user.php

    public function index()
    {
        $db = \Config\Database::connect();

        $reviews = $db->table('reviews')
                      ->select('reviews.*, users.username')
                      ->join('users', 'users.id = reviews.user_id', 'left')
                      ->orderBy('reviews.created_at', 'DESC')
                      ->limit(3)
                      ->get()
                      ->getResultArray();

        $seaCondition = $db->table('sea_conditions')
                           ->orderBy('recorded_at', 'DESC')
                           ->limit(1)
                           ->get()
                           ->getRowArray();
---
SELECT `reviews`.*, `users`.`username`
FROM `reviews`
LEFT JOIN `users` ON `users`.`id` = `reviews`.`user_id`
ORDER BY `reviews`.`created_at` DESC
 LIMIT 3
SELECT *
FROM `sea_conditions`
ORDER BY `recorded_at` DESC
 LIMIT 1

    public function reviews()
    {
        $db = \Config\Database::connect();

        $reviews = $db->table('reviews')
                      ->select('reviews.*, users.username')
                      ->join('users', 'users.id = reviews.user_id', 'left')
                      ->orderBy('reviews.created_at', 'DESC')
                      ->get()
                      ->getResultArray();

        $avgResult = $db->table('reviews')->selectAvg('rating', 'avg_rating')->get()->getRowArray();
---
SELECT `reviews`.*, `users`.`username`
FROM `reviews`
LEFT JOIN `users` ON `users`.`id` = `reviews`.`user_id`
ORDER BY `reviews`.`created_at` DESC
SELECT AVG(`rating`) AS `avg_rating`
FROM `reviews`

    public function bookingDetails($id)
    {
        $bookingModel = new BookingModel();
        $userId       = auth()->user()->id;
        $booking      = $bookingModel->getByIdAndUser((int) $id, $userId);

        if (! $booking) {
            return redirect()->to(base_url('user/my-bookings'))
                             ->with('error', 'Booking not found.');
---
SELECT *
FROM `bookings`
WHERE `user_id` = 8
ORDER BY `created_at` DESC