src/app/Views/admin/bookings.php

                function adminBuildTpaMap(array $b, array $actNames, $db): array {
                    $tpaMap = [];
                    if (!empty($b['time_per_activity'])) {
                        $dec = json_decode($b['time_per_activity'], true);
                        if (is_array($dec)) $tpaMap = $dec;
                    }
                    if (empty($tpaMap)) {
                        $cursor = strtotime('1970-01-01 ' . ($b['time'] ?? '08:00:00'));
                        foreach ($actNames as $an) {
                            $an = trim($an);
                            $tpaMap[$an] = date('H:i:s', $cursor);
                            $tRow = $db->table('activities')->where('name', $an)->get()->getRowArray();
---
SELECT *
FROM `activities`
WHERE `name` = 'Kayaking'