src/app/Views/admin/dashboard.php

    <!-- KPI CARDS -->
    <?php
        $db = \Config\Database::connect();
        $totalRevenue = $db->table('bookings')->where('status !=', 'cancelled')->selectSum('total_amount','total')->get()->getRowArray()['total'] ?? 0;
---
SELECT SUM(`total_amount`) AS `total`
FROM `bookings`
WHERE `status` != 'cancelled'

        $weeklySales = [];
        for ($i = 6; $i >= 0; $i--) {
            $day = date('Y-m-d', strtotime("-$i days"));
            $amt = $db->table('bookings')->where('status !=','cancelled')->where('DATE(created_at)', $day)->selectSum('total_amount','total')->get()->getRowArray()['total'] ?? 0;
---
SELECT SUM(`total_amount`) AS `total`
FROM `bookings`
WHERE `status` != 'cancelled'
AND DATE(created_at) = '2026-04-18'