src/app/Views/admin/dashboard.php

    <!-- KPI CARDS -->
    <?php
        $db = \Config\Database::connect();
        $totalRevenue = $db->table('bookings')->where('status !=', 'cancelled')->selectSum('total_amount','total')->get()->getRowArray()['total'] ?? 0;
---
SELECT SUM(`total_amount`) AS `total`
FROM `bookings`
WHERE `status` != 'cancelled'

    <!-- CHARTS -->
    <?php
        // Activity distribution for pie chart
        $activityCounts = $db->table('bookings')
            ->select('activity_name, COUNT(*) as count')
            ->where('status !=', 'cancelled')
            ->groupBy('activity_name')
            ->get()->getResultArray();
---
SELECT `activity_name`, COUNT(*) as count
FROM `bookings`
WHERE `status` != 'cancelled'
GROUP BY `activity_name`

        $weeklySales = [];
        for ($i = 6; $i >= 0; $i--) {
            $day = date('Y-m-d', strtotime("-$i days"));
            $amt = $db->table('bookings')->where('status !=','cancelled')->where('DATE(created_at)', $day)->selectSum('total_amount','total')->get()->getRowArray()['total'] ?? 0;
---
SELECT SUM(`total_amount`) AS `total`
FROM `bookings`
WHERE `status` != 'cancelled'
AND DATE(created_at) = '2026-05-04'

        $monthlySales = [];
        for ($i = 5; $i >= 0; $i--) {
            $mo  = date('Y-m', strtotime("-$i months"));
            $amt = $db->table('bookings')->where('status !=','cancelled')->where('DATE_FORMAT(created_at,\'%Y-%m\')', $mo)->selectSum('total_amount','total')->get()->getRowArray()['total'] ?? 0;
---
SELECT SUM(`total_amount`) AS `total`
FROM `bookings`
WHERE `status` != 'cancelled'
AND DATE_FORMAT(created_at,'%Y-%m') = '2025-12'

        $yearlySales = [];
        for ($i = 2; $i >= 0; $i--) {
            $yr  = date('Y', strtotime("-$i years"));
            $amt = $db->table('bookings')->where('status !=','cancelled')->where('YEAR(created_at)', $yr)->selectSum('total_amount','total')->get()->getRowArray()['total'] ?? 0;
---
SELECT SUM(`total_amount`) AS `total`
FROM `bookings`
WHERE `status` != 'cancelled'
AND YEAR(created_at) = '2024'