src/app/Views/admin/sales.php

    $db = \Config\Database::connect();

    // KPIs
    $totalRevenue    = (float)($db->table('bookings')->where('status !=','cancelled')->selectSum('total_amount','t')->get()->getRowArray()['t'] ?? 0);
    $monthRevenue    = (float)($db->table('bookings')->where('status !=','cancelled')->where('DATE_FORMAT(created_at,\'%Y-%m\')', date('Y-m'))->selectSum('total_amount','t')->get()->getRowArray()['t'] ?? 0);
    $weekRevenue     = (float)($db->table('bookings')->where('status !=','cancelled')->where('created_at >=', date('Y-m-d', strtotime('-7 days')))->selectSum('total_amount','t')->get()->getRowArray()['t'] ?? 0);
    $paidCount       = $db->table('bookings')->where('payment_status','paid')->countAllResults();
    $unpaidCount     = $db->table('bookings')->where('payment_status','unpaid')->where('status !=','cancelled')->countAllResults();
    $totalBookings   = $db->table('bookings')->where('status !=','cancelled')->countAllResults();

    // Activity revenue breakdown
    $actRevenue = $db->table('bookings b')
        ->select('activity_name, COUNT(*) as count, SUM(total_amount) as revenue')
        ->where('b.status !=','cancelled')
        ->groupBy('activity_name')
        ->orderBy('revenue','DESC')
        ->get()->getResultArray();
---
SELECT SUM(`total_amount`) AS `t`
FROM `bookings`
WHERE `status` != 'cancelled'
SELECT SUM(`total_amount`) AS `t`
FROM `bookings`
WHERE `status` != 'cancelled'
AND DATE_FORMAT(created_at,'%Y-%m') = '2026-05'
SELECT SUM(`total_amount`) AS `t`
FROM `bookings`
WHERE `status` != 'cancelled'
AND `created_at` >= '2026-04-29'
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `payment_status` = 'paid'
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `payment_status` = 'unpaid'
AND `status` != 'cancelled'
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `status` != 'cancelled'
SELECT `activity_name`, COUNT(*) as count, SUM(total_amount) as revenue
FROM `bookings` `b`
WHERE `b`.`status` != 'cancelled'
GROUP BY `activity_name`
ORDER BY `revenue` DESC

    $weeklySales = [];
    for ($i = 6; $i >= 0; $i--) {
        $day = date('Y-m-d', strtotime("-$i days"));
        $amt = (float)($db->table('bookings')->where('status !=','cancelled')->where('DATE(created_at)', $day)->selectSum('total_amount','t')->get()->getRowArray()['t'] ?? 0);
---
SELECT SUM(`total_amount`) AS `t`
FROM `bookings`
WHERE `status` != 'cancelled'
AND DATE(created_at) = '2026-04-30'

    $monthlySales = [];
    for ($i = 5; $i >= 0; $i--) {
        $mo  = date('Y-m', strtotime("-$i months"));
        $amt = (float)($db->table('bookings')->where('status !=','cancelled')->where('DATE_FORMAT(created_at,\'%Y-%m\')', $mo)->selectSum('total_amount','t')->get()->getRowArray()['t'] ?? 0);
---
SELECT SUM(`total_amount`) AS `t`
FROM `bookings`
WHERE `status` != 'cancelled'
AND DATE_FORMAT(created_at,'%Y-%m') = '2025-12'

    $yearlySales = [];
    for ($i = 2; $i >= 0; $i--) {
        $yr  = date('Y', strtotime("-$i years"));
        $amt = (float)($db->table('bookings')->where('status !=','cancelled')->where('YEAR(created_at)', $yr)->selectSum('total_amount','t')->get()->getRowArray()['t'] ?? 0);
---
SELECT SUM(`total_amount`) AS `t`
FROM `bookings`
WHERE `status` != 'cancelled'
AND YEAR(created_at) = '2024'

    }

    // All transactions
    $transactions = $db->table('bookings b')
        ->select('b.*, u.username')
        ->join('users u','u.id = b.user_id','left')
        ->orderBy('b.created_at','DESC')
        ->get()->getResultArray();
---
SELECT `b`.*, `u`.`username`
FROM `bookings` `b`
LEFT JOIN `users` `u` ON `u`.`id` = `b`.`user_id`
ORDER BY `b`.`created_at` DESC

        $vals = [];
        for ($i = 2; $i >= 0; $i--) {
            $mo  = date('Y-m', strtotime("-$i months"));
            $amt = (float)($db->table('bookings')->where('activity_name',$act)->where('status !=','cancelled')->where('DATE_FORMAT(created_at,\'%Y-%m\')', $mo)->selectSum('total_amount','t')->get()->getRowArray()['t'] ?? 0);
---
SELECT SUM(`total_amount`) AS `t`
FROM `bookings`
WHERE `activity_name` = 'Banana Boat'
AND `status` != 'cancelled'
AND DATE_FORMAT(created_at,'%Y-%m') = '2026-03'