src/app/Views/user/booking_details.php

    $db      = \Config\Database::connect();
    $actRows = [];
    foreach ($allActNames as $an) {
        $row = $db->table('activities')->where('name', trim($an))->get()->getRowArray();
---
SELECT *
FROM `activities`
WHERE `name` = 'Jet Ski'